import {IContent} from "./app.interface";

export const CONTENT: IContent[] = [
  { image: '🥦', title: '🥦 самозапрет на невкусную еду 🥦' },
  { image: '🍺', title: '🍺 самозапрет на обед без пивка 🍺' },
  { image: '☕', title: '☕ самозапрет на утро без кофейка ☕' },
  { image: '🏃‍♂️', title: '🏃‍♂️ самозапрет на зож 🏃‍♂️' },
  { image: '❓', title: '❓ самозапрет на тупые вопросы ❓' },
  { image: '💯', title: '💯 самозапрет на душноту 💯' },
  { image: '🪲', title: '🪲 самозапрет на баги по самозапретам 🪲' },
  { image: '📞', title: '📞 самозапрет на подозрительные ссылки 📞' },
  { image: '🩼', title: '🩼 самозапрет на провокации Сбера 🩼' },
  { image: '🔞', title: '🔞 самозапрет на ссылки от Сашурина 🔞' },
  { image: '🩰', title: '🩰 самозапрет на одинаковые носки 🩰' },
  { image: '✈️', title: '✈️ самозапрет на релизы в пятницу ✈️' },
  { image: '💤', title: '💤 самозапрет на дейлики в 9 утра 💤' },
  { image: '👥', title: '👥 самозапрет на новые чаты 👥' },
  { image: '🗂️', title: '🗂️ самозапрет на бюрократию 🗂️' },
  { image: '🐞', title: '🐞 самозапрет на баги от ucb core 🐞' },
  { image: '🔄', title: '🔄 самозапрет на самозапрет 🔄' },
  { image: '😤', title: '😤 самозапрет на плохое настроение 😤' },
  { image: '🫥', title: '🫥 самозапрет на непродуктивные встречи 🫥' },
  { image: '🕰️', title: '🕰️ самозапрет на долгие встречи 🕰️' }
];
