import {IContent} from "./app.interface";

export const CONTENT: IContent[] = [
  {image: '🥦', title: '🥦 самозапрет на невкусную еду 🥦'},
  {image: '🍺', title: '🍺 самозапрет на обед без пивка 🍺'},
  {image: '☕', title: '☕ самозапрет на утро без кофейка ☕'},
  {image: '🏃‍♂️', title: '🏃‍♂️ самозапрет на зож 🏃‍♂️'},
  {image: '❓', title: '❓ самозапрет на тупые вопросы ❓'},
  {image: '💯', title: '💯 самозапрет на душноту 💯'},
  {image: '🪲', title: '🪲 самозапрет на баги по самозапретам 🪲'},
  {image: '📞', title: '📞 самозапрет на подозрительные ссылки 📞'},
  {image: '🩼', title: '🩼 самозапрет на провокации Сбера 🩼'},
  {image: '🔞', title: '🔞 самозапрет на ссылки от Сашурина 🔞'},
  {image: '🧦', title: '🧦 самозапрет на одинаковые носки 🧦'},
  {image: '✈️', title: '✈️ самозапрет на релизы в пятницу ✈️'},
  {image: '💤', title: '💤 самозапрет на дейлики в 9 утра 💤'},
  {image: '👥', title: '👥 самозапрет на новые чаты 👥'},
  {image: '🗂️', title: '🗂️ самозапрет на бюрократию 🗂️'},
  {image: '🐞', title: '🐞 самозапрет на баги от ucb core 🐞'},
  {image: '🔄', title: '🔄 самозапрет на самозапрет 🔄'},
  {image: '😤', title: '😤 самозапрет на плохое настроение 😤'},
  {image: '🫥', title: '🫥 самозапрет на непродуктивные встречи 🫥'},
  {image: '🕰️', title: '🕰️ самозапрет на долгие встречи 🕰️'},
  {image: "🛠️", title: "🛠️ самозапрет на ремонт 🛠️"},
  {image: "🦠", title: "🦠 самозапрет на болезнь в праздники 🦠"},
  {image: "🪒", title: "🪒 самозапрет на бритье 🪒"},
  {image: "🛌", title: "🛌 самозапрет на ранний подъём 🛌"},
  {image: "🛗", title: "🛗 самозапрет на поход в ТЦ с женой 🛗"},
  {image: "🐕", title: "🐕 самозапрет на выгул собаки по утрам 🐕"},
  {image: "🏋️‍♂️", title: "🏋️‍♂️ самозапрет на поход в спортзал 🏋️‍♂️"},
  {image: "🍳", title: "🍳 самозапрет на готовку дома 🍳"},
  {image: "⛹️‍♂️", title: "⛹️‍♂️ самозапрет на треники ⛹️‍♂️"},
  {image: "🪞", title: "🪞 самозапрет на гляделки в зеркало (и так красивый) 🪞"},
  {image: "🏢", title: "🏢 самозапрет на поход в офис 🏢"},
  {image: "🙆‍♂️", title: "🙆‍♂️ самозапрет на работу после 18:00 🙆‍♂️"},
  {image: "🛗", title: "🛗 самозапрет на нажатие кнопок в лифте 🛗"},
  {image: "🧠", title: "🧠 самозапрет на умные мысли 🧠"},
  {image: "🟢", title: "🟢 сегодня нет самозапретов! можно всё! 🟢"}
];

export const MESSAGE: {lk: string, all: string, error: string} =
  {
    lk: '<h3> Дорогие коты! 😻</h3><p>С 23 февраля! Пусть в вашей жизни будет столько же радости, сколько у сына маминой подруги, когда он получает свою  зарплату! Желаем вам наслаждаться каждым моментом, как истинные ценители самарского гедонизма, и находить счастье в мелочах. Пусть ваши проекты выдают базу для успешного развития, а если вдруг возникнут сложности, помните: сделать админку — это решение!  И пусть если судьба и попытается отвернуть вас от цели, то только на 360)))<br>С праздником!</p>',
    all: '<h3> Дорогие коллеги и друзья из команды ОКБ!</h3><p>С 23 февраля! Пусть ваши алгоритмы всегда работают без сбоев, а код компилируется с первого раза! Пусть каждый новый релиз будет успешным, а идеи для улучшения проекта приходят в голову в самый подходящий момент)) С праздником, команда ОКБ!<br> Вы — лучшие! 🖥️🎉✨</p>',
    error: '<h2>Ты точно человек? 🤖</h2>'
  }
